from utils.file_utils import UTILS_CONST, file_util_foo
from utils.api_utils import api_util_foo
from utils.bananas import bananas
from dotenv import load_dotenv
import os

load_dotenv()
POLZA_API_KEY = os.getenv("POLZA_API_KEY")
IS_READY = True if os.getenv("IS_READY") == "True" else False

print(POLZA_API_KEY, IS_READY)


# from utils import * # в __init__.py мы можем указать какие файлы нужно импортировать

def main():
    file_util_foo(UTILS_CONST)
    api_util_foo("привет")
    bananas()
    print("Моя програамма работает!!!")

if __name__ == "__main__":
    main()
"""
Хлебные крошки запускаются через `Ctrl+Shift+.` (точка, которая находится на клавише «Ю»). По-моему, на русской раскладке тоже запускается. И вы можете использовать навигацию по хлебным крошкам — это очень удобно для перемещения внутри одного большого файла.

Ещё есть опция для навигации между файлами — это `Ctrl+Tab`. Вы можете видеть все файлы сверху во всплывающей подсказке.

А ещё есть замечательный `Ctrl+P`: можно просто начать вбивать название файла, и вам подскажут файлы, соответствующие этому названию.

Также есть `Ctrl+Shift+F` — это буквально полнотекстовый поиск по всему проекту, по всем документам. Допустим, я ищу `моя Pro` и нахожу такое вхождение в конкретном месте, в конкретном документе. Я могу кликнуть сюда или сюда, и у меня откроется нужное место — даже строчка подсвечивается. Очень удобно!
"""

"""
# ! praktika
Попробуйте набрать эти три файла. У вас в проекте должна быть плоская структура. Рядом лежат три Python-файла: `main.py`, `utils.py` и `bananas.py`. Обратите внимание на импорты: вы должны набрать точно так, как написано у меня в коде. После этого ваша задача — запустить через Python файлик `main.py`. Обратите внимание на терминал: в терминале вы увидите хвосты, которые были импортированы фоном.
 
Принты, которые вы видите у меня в коде на строке номер 6 в файлике `utils.py` и на строке номер 1 в файлике `bananas.py`... Эти принты отработают, и печатают они одинаковую вещь — `__name__`. Но так как этот `__name__` придёт к нам в `main.py` из разных модулей, он будет иметь разные значения.
 
По сути, он как оборотень, который приобретает имя своего модуля, откуда он пришёл, если он пришёл из другого файла.
"""