UTILS_CONST = "Констанца файла utils"

def file_util_foo(param: str):
    print("Функция утилита foo")

print(__name__)
if __name__ == "__main__":
    print("Проверка работы util_foo")
    file_util_foo(UTILS_CONST)

"""
Конструкция `__name__` в Python — достаточно хитрая штука. В зависимости от того, запускается ли этот код напрямую или же он импортируется, содержание этой переменной будет разным.
 
Если я напишу эту штуку в файле и запущу напрямую этот файл, там всегда будет содержаться строка `'__main__'`. Однако же, если эта штука залетит случайно с импортом в другой файл, в ней будет содержаться название её родного файла.
 
Таким образом, если из файла `utils` этот импорт попадёт в файлик `main`, условие перестанет выполняться, и предохранитель сработает. Служебный код для отладки, набранный в `utils.py`, не будет запускаться, потому что в другом файле содержание переменной `__name__` будет равно `'utils'`. Очень удобно!
"""